---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions
source: html/3daf2ae9-b313-b278-f462-e91412298a52.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions

Describes how the Bending Detail will be represented for 3D shapes.

## Syntax (C#)
```csharp
public enum BendingDetailFor3DShapesOptions
```